USE PizzaProduction;
GO

INSERT INTO Пользователи (логин, пароль, роль, заблокирован) VALUES
('admin', 'admin123', 'Администратор', 0),
('user1', 'user123', 'Пользователь', 0),
('user2', 'user456', 'Пользователь', 0),
('blocked_user', 'test123', 'Пользователь', 1);
GO

INSERT INTO Заказы (заказчик_id, номер_заказа, дата_заказа) VALUES
('000000002', 'ЗК-001', '2025-06-06'),
('000000003', 'ЗК-002', '2025-06-07'),
('000000009', 'ЗК-003', '2025-06-08');

INSERT INTO Заказы_Строки (заказ_id, продукция_id, количество, цена) VALUES
(1, 1, 4, 850),
(1, 2, 6, 710),
(2, 1, 2, 850),
(2, 3, 3, 420),
(3, 4, 5, 640);
GO